---
type: StructuralSectionGeneralCEx
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 3
tags: [revit-api, class]
---

# StructuralSectionGeneralCEx

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralCEx` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionGeneralCEx | 2018 | `public StructuralSectionGeneralCEx ( double width , double height , double wallNominalThickness , double wallDesignThickness , double innerFillet , double lipLength , double foldLength , double centroidHorizontal , doubl` |
| Property | FoldLength | 2018 | `public double FoldLength { get ; set ; }` |
| Property | LipLength | 2018 | `public double LipLength { get ; set ; }` |